Revit 2024 API
BuiltInFailures.CurveByPointFailures Class
 Failures about Curve By Point Element
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class CurveByPointFailures
Visual Basic
Public NotInheritable Class CurveByPointFailures
Visual C++
public ref class CurveByPointFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.CurveByPointFailures
See Also
BuiltInFailures.CurveByPointFailures Members
Autodesk.Revit.DB Namespace